13-rails-forms/vehicles/app/controllers/vehicles_controller.rb

  def create
    vehicle = Vehicle.create(vehicle_params)
---
INSERT INTO "vehicles" ("make", "model", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["make", "sfdhjk"], ["model", "dsfhjk"], ["color", "sfjkh"], ["created_at", "2020-02-25 16:59:58.285551"], ["updated_at", "2020-02-25 16:59:58.285551"]]

  def update
    @vehicle.update(vehicle_params)
---
UPDATE "vehicles" SET "color" = ?, "make" = ?, "model" = ?, "updated_at" = ? WHERE "vehicles"."id" = ?  [["color", "5"], ["make", "5"], ["model", "5"], ["updated_at", "2020-02-25 17:00:04.984634"], ["id", 5]]

  def get_vehicle_by_id
    @vehicle = Vehicle.find(params[:id])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]